//*************************************************************************************************************
//
// 敵のマネージャー処理[EnemyMana.h]
// Author : Sekine Ikuto
//
//*************************************************************************************************************
#ifndef _ENEMYMANA_H_
#define _ENEMYMANA_H_

//-------------------------------------------------------------------------------------------------------------
// インクルードファイル
//-------------------------------------------------------------------------------------------------------------
#include "Mylibrary.h"

//-------------------------------------------------------------------------------------------------------------
// マクロ定義
//-------------------------------------------------------------------------------------------------------------
#define ENEMYMANA_COUPLE_MAX		(9)
#define ENEMYMANA_NEWLYWED_MAX		(2)
#define ENEMYMANA_STUDENT_MAX		(20)

//-------------------------------------------------------------------------------------------------------------
// クラス定義
//-------------------------------------------------------------------------------------------------------------
class CEnemy;
class CEnemyMana
{
public:
	CEnemyMana();							// コンストラクタ
	~CEnemyMana();							// デストラクタ

	static CEnemyMana * Create(void);		// 生成
	void Init(void);						// 初期化
	void Uninit(void);						// 終了
	void Update(void);						// 更新
	void Draw(void);						// 描画

private:

	void Collision(void);					// 衝突
	void StudentAppearance(void);			// 学生の出現
	void NewlywedAppearance(void);			// 新婚出現
	void CoupleAppearance(void);			// 夫婦の出現

	vector<CEnemy*> m_pStudent;				// 学生ポインタ
	vector<CEnemy*> m_pCouple;				// 夫婦ポインタ
	vector<CEnemy*> m_pNewLywed;			// 新婚ポインタ

};

#endif