//*************************************************************************************************************
//
// 入力処理[keyboard.h]
// Author : Sekine Ikuto
//
//*************************************************************************************************************
#ifndef _KEYBOARD_H_
#define _KEYBOARD_H_

//-------------------------------------------------------------------------------------------------------------
// インクルードファイル
//-------------------------------------------------------------------------------------------------------------
#include "input.h"

//-------------------------------------------------------------------------------------------------------------
// マクロ定義
//-------------------------------------------------------------------------------------------------------------
#define	NUM_KEY_MAX			(256)	// キーの最大数

//-------------------------------------------------------------------------------------------------------------
// クラス定義
//-------------------------------------------------------------------------------------------------------------
class Ckeyboard:public CInput
{
public:
	Ckeyboard();												// コンストラクタ
	~Ckeyboard();												// デストラクタ
	HRESULT           Init(HINSTANCE hInstance, HWND hWnd);		// 初期化
	void              Uninit(void);								// 終了
	void              Update(void);								// 更新
	static Ckeyboard* Create(HINSTANCE hInstance, HWND hWnd);	// 生成
	bool              GetPress(int nKey);						// 押している間
	bool              GetTrigger(int nKey);						// 押した時
	bool              GetRelease(int nKey);						// 離した時
	int               GetKeyIndex(void);						// 押したキーの取得
private:
	BYTE m_aKeyState[NUM_KEY_MAX];								// キーボードの入力情報ワーク
	BYTE m_aKeyStateTrigger[NUM_KEY_MAX];						// キーボードの入力情報ワーク
	BYTE m_aKeyStateRelease[NUM_KEY_MAX];						// キーボードの入力情報ワーク
protected:
};

#endif
