//*************************************************************************************************************
//
// プレイヤーの処理[player.cpp]
// Author : Sekine Ikuto
//
//*************************************************************************************************************
//-------------------------------------------------------------------------------------------------------------
// インクルードファイル
//-------------------------------------------------------------------------------------------------------------
#include "player.h"
#include "Scene2D.h"
#include "texture.h"

//-------------------------------------------------------------------------------------------------------------
// マクロ定義
//-------------------------------------------------------------------------------------------------------------
#define PLAYER_GAGEFRAME_SIZE_Y (20.0f)							// ゲージフレームのサイズY
#define PLAYER_GAGE_SIZE_X      (100.0f)						// ゲージのサイズX
#define PLAYER_FRAME_SIZE_X     (100.0f)						// 枠のサイズX

//-------------------------------------------------------------------------------------------------------------
// 静的メンバ変数の初期化
//-------------------------------------------------------------------------------------------------------------
CONST D3DXVECTOR2 CPlayer::m_aDiffpos[CPlayer::UI_MAX] = {
	{ -50.0f,60.0f },
	{ -50.0f,60.0f },
};

CONST D3DXCOLOR   CPlayer::m_aInitUiCol[UI_MAX] = {
	{ 1.0f,1.0f,1.0f,1.0f },
	{ 0.5f,0.5f,0.5f,1.0f },
};

CONST D3DXVECTOR2 CPlayer::m_aInitUiSize[UI_MAX] = {
	{ 0.0f,20.0f },
	{ 100.0f,20.0f },
};

//-------------------------------------------------------------------------------------------------------------
// 生成
//-------------------------------------------------------------------------------------------------------------
CPlayer * CPlayer::Create(D3DXVECTOR3 pos, D3DXVECTOR2 size)
{
	CPlayer *pPlayer = new CPlayer;
	pPlayer->InitImage(pos, size);
	pPlayer->Init();
	return pPlayer;
}

//-------------------------------------------------------------------------------------------------------------
// 初期化
//-------------------------------------------------------------------------------------------------------------
void CPlayer::Init(void)
{

}

//-------------------------------------------------------------------------------------------------------------
// 終了
//-------------------------------------------------------------------------------------------------------------
void CPlayer::Uninit(void)
{
}

//-------------------------------------------------------------------------------------------------------------
// 更新
//-------------------------------------------------------------------------------------------------------------
void CPlayer::Update(void)
{
}

//-------------------------------------------------------------------------------------------------------------
// 描画
//-------------------------------------------------------------------------------------------------------------
void CPlayer::Draw(void)
{
}

//-------------------------------------------------------------------------------------------------------------
// 画像の初期化
//-------------------------------------------------------------------------------------------------------------
void CPlayer::InitImage(D3DXVECTOR3 &pos, D3DXVECTOR2 &size)
{
	// サイズの再設定
	m_pImage.resize(IMG_MAX);
	// プレイヤーの体
	m_pImage[IMG_BODY] = CScene2D::Create(PRIORITY_CHARACTER, pos, ML_D3DXCOR_SET, ORIGINVERTEXTYPE_ROTCENTER, size);
	m_pImage[IMG_BODY]->BindTexture(CTexture::GetTextureInfo(CTexture::NAME_PLAYER));
	// ゲージ
	m_pImage[IMG_GAGE] = CScene2D::Create(PRIORITY_CHARACTER, pos, m_aInitUiCol[UI_GAGE], ORIGINVERTEXTYPE_CENTERLEFT, m_aInitUiSize[UI_GAGE]);
	m_pImage[IMG_GAGE]->BindTexture(CTexture::GetTextureInfo(CTexture::NAME_GAGE));
	// 枠
	m_pImage[IMG_FRAME] = CScene2D::Create(PRIORITY_CHARACTER, pos, m_aInitUiCol[UI_FRAME], ORIGINVERTEXTYPE_CENTERLEFT, m_aInitUiSize[UI_FRAME]);
	m_pImage[IMG_FRAME]->BindTexture(CTexture::GetTextureInfo(CTexture::NAME_FRAME));
}
