//*************************************************************************************************************
//
// チュートリアル処理 [tutorial.h]
// Author:IKUTO SEKINE
//
//*************************************************************************************************************
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

//-------------------------------------------------------------------------------------------------------------
// インクルードファイル
//-------------------------------------------------------------------------------------------------------------
#include "mode.h"

//-------------------------------------------------------------------------------------------------------------
// クラス定義
//-------------------------------------------------------------------------------------------------------------
class C2DUi;
class CTutorial : public CMode
{
public:
	/* 列挙型 */
	typedef enum
	{
		TYPE_NAME = 0,
		TYPE_KEYINFO,
		TYPE_MAX
	} TYPE;

	/* 関数 */
	CTutorial() {};					// コンストラクタ
	~CTutorial() {};					// デストラクタ

	static CTutorial *Create(void);	// 生成
	void Init(void);				// 初期化
	void Uninit(void);				// 終了
	void Update(void);				// 更新
	void Draw(void);				// 描画

private:
	C2DUi *m_pC2dui[TYPE::TYPE_MAX];	// ２DUIポインタ
};

#endif